app/views/profiles/_profile.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 1]]
---
      <h3>Your orders</h3>
      (<%= pluralize(@current_user.orders.count,"Order")%> in total)<br>