app/views/departments/index.html.erb

  <% if session[:user_id] %>
    <li><%= link_to 'My Profile', user_path(User.find(session[:user_id])) %></li>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]