app/views/departments/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  <% if session[:user_id] %>
    <li><%= link_to 'My Profile', user_path(User.find(session[:user_id])) %></li>