app/views/orders/index.html.erb

SELECT "orders".* FROM "orders"
SELECT COUNT(*) FROM "orders"
---
<p id="notice"><%= notice %></p>
<h1><%=pluralize(@orders.count,"Order")%> in total</h1>