app/controllers/admins_controller.rb

INSERT INTO "admins" ("email", "passowrd_salt", "password_hash", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @admin = Admin.new(admin_params)

    respond_to do |format|
      if @admin.save