app/controllers/departments_controller.rb

    def set_department_list
      @departments = Department.all
---
SELECT "departments".* FROM "departments"