app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-09-30 04:16:02.778922"], ["updated_at", "2015-09-30 04:16:02.778922"]]
INSERT INTO "line_items" ("product_id", "price", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["product_id", 1], ["price", 16000.0], ["cart_id", 15], ["created_at", "2015-09-30 05:43:54.740045"], ["updated_at", "2015-09-30 05:43:54.740045"]]
UPDATE "carts" SET "user_id" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["user_id", 2], ["updated_at", "2015-09-30 05:33:36.838924"], ["id", 15]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2015-09-30 05:47:37.254990"], ["id", 1]]
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id, product.price)

    respond_to do |format|
      if @line_item.save