app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("name", "email", "contact_no", "pay_type", "address", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)