app/controllers/products_controller.rb

  def show
    @departments = Department.all
    @product = Product.find(params[:id])
---
SELECT "departments".* FROM "departments"
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("title", "description", "image", "price", "active", "department_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)