app/controllers/profiles_controller.rb

  def create
    @user = User.find(session[:user_id])
    @profile = Profile.new(profile_params)

    respond_to do |format|
      if @profile.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "profiles" ("name", "contact_no", "address", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Rakesh"], ["contact_no", "8553302191"], ["address", "Bengaluru"], ["user_id", 0], ["created_at", "2015-09-29 09:27:50.979844"], ["updated_at", "2015-09-29 09:27:50.979844"]]

  def update
    respond_to do |format|
      if @profile.update(profile_params)
---
UPDATE "profiles" SET "address" = ?, "user_id" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["address", "Bengaluru"], ["user_id", 1], ["updated_at", "2015-09-29 12:23:09.104252"], ["id", 1]]