app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_salt", "password_hash", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save