app/views/products/_form.html.erb

    <%= f.label :department_id %>
    <%= f.select :department_id, Department.all.collect { |e| [e.name, e.id] }, prompt: 'Select a department' %>
---
SELECT  "departments".* FROM "departments"  ORDER BY "departments"."id" ASC LIMIT 1